In [13]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import getpass  # To get the password without showing the input
password = getpass.getpass()

········

In [14]:
connection_string = 'mysql+pymysql://root:' + password + '@localhost/sakila'
engine = create_engine(connection_string)

In [21]:
query = 'SELECT r.rental_date, inv.film_id, ficat.category_id, fi.rental_rate \
FROM sakila.rental AS r \
JOIN sakila.inventory AS inv \
USING (inventory_id) \
JOIN sakila.film AS fi \
USING (film_id) \
JOIN sakila.film_category AS ficat \
USING (film_id) \
JOIN sakila.category AS cat \
USING (category_id) \
WHERE cat.category_id <= 5'

In [22]:
data = pd.read_sql_query(query,connection_string)
data.head()

          rental_date  film_id  category_id  rental_rate
0 2005-08-02 01:16:59       19            1         0.99
1 2005-08-18 04:26:54       19            1         0.99
2 2005-06-20 20:35:28       19            1         0.99
3 2005-07-09 05:01:58       19            1         0.99
4 2005-07-30 08:02:39       19            1         0.99

In [17]:
data['rental_date'] = pd.to_datetime(data['rental_date'])

In [18]:
data['rental_year'] = pd.DatetimeIndex(data['rental_date']).year
data['rental_month'] = pd.DatetimeIndex(data['rental_date']).month
data = data.drop(['rental_date'],axis=1)

In [19]:
data.dtypes

film_id         int64
category_id     int64
rental_year     int64
rental_month    int64
dtype: object

In [20]:
cat = data.drop(['category_id'], axis=1)
cat

      film_id  rental_year  rental_month
0          19         2005             8
1          19         2005             8
2          19         2005             6
3          19         2005             7
4          19         2005             7
...       ...          ...           ...
5098     1000         2005             5
5099     1000         2005             6
5100     1000         2005             7
5101     1000         2005             7
5102     1000         2005             8

[5103 rows x 3 columns]

In [ ]:
categorical = pd.get_dummies(cat, columns=['film_id', 'rental_year', 'rental_month'])
categorical